==================
Single line I
==================

f x = let y = x in y

---

(source_file
    (function_clause
        (lhs
            (atom (qualified_name))
            (atom (qualified_name)))
        (rhs
            (expr
                (let
                    (function_clause_test
                        (lhs
                            (atom (qualified_name)))
                        (rhs
                            (expr
                                (atom (qualified_name)))))
                    (expr (atom (qualified_name))))))))

==================
Single line II
==================

f x = let y = x in
    y

---

(source_file
    (function_clause
        (lhs
            (atom (qualified_name))
            (atom (qualified_name)))
        (rhs
            (expr
                (let
                    (function_clause_test
                        (lhs
                            (atom (qualified_name)))
                        (rhs
                            (expr
                                (atom (qualified_name)))))
                    (expr (atom (qualified_name))))))))

==================
Single line III
==================

f x = let y = x
      in y

---

(source_file
    (function_clause
        (lhs
            (atom (qualified_name))
            (atom (qualified_name)))
        (rhs
            (expr
                (let
                    (function_clause_test
                        (lhs
                            (atom (qualified_name)))
                        (rhs
                            (expr
                                (atom (qualified_name)))))
                    (expr (atom (qualified_name))))))))

==================
Multiline I
==================

f x = let y = x
          y = x in y

---

(source_file
    (function_clause
        (lhs
            (atom (qualified_name))
            (atom (qualified_name)))
        (rhs
            (expr (let
                (function_clause_test
                    (lhs
                        (atom (qualified_name)))
                    (rhs
                        (expr (atom (qualified_name)))))
                (function_clause_test
                    (lhs
                        (atom (qualified_name)))
                    (rhs
                        (expr (atom (qualified_name)))))
                (expr (atom (qualified_name))))))))

==================
Multiline II
==================

f x = let y = x
          y = x in
    y

---

(source_file
    (function_clause
        (lhs
            (atom (qualified_name))
            (atom (qualified_name)))
        (rhs
            (expr (let
                (function_clause_test
                    (lhs
                        (atom (qualified_name)))
                    (rhs
                        (expr (atom (qualified_name)))))
                (function_clause_test
                    (lhs
                        (atom (qualified_name)))
                    (rhs
                        (expr (atom (qualified_name)))))
                (expr (atom (qualified_name))))))))

==================
Multiline III
==================

f x = let y = x
          y = x
      in y

---

(source_file
    (function_clause
        (lhs
            (atom (qualified_name))
            (atom (qualified_name)))
        (rhs
            (expr (let
                (function_clause_test
                    (lhs
                        (atom (qualified_name)))
                    (rhs
                        (expr (atom (qualified_name)))))
                (function_clause_test
                    (lhs
                        (atom (qualified_name)))
                    (rhs
                        (expr (atom (qualified_name)))))
                (expr (atom (qualified_name))))))))

==================
Telescope I
==================

f x = let y = x in
      let y = x in y

---

(source_file
    (function_clause
        (lhs
            (atom (qualified_name))
            (atom (qualified_name)))
        (rhs
            (expr
                (let
                    (function_clause_test
                        (lhs
                            (atom (qualified_name)))
                        (rhs
                            (expr (atom (qualified_name)))))
                    (expr
                        (let
                            (function_clause
                                (lhs
                                    (atom (qualified_name)))
                                (rhs
                                    (expr (atom (qualified_name)))))
                            (expr (atom (qualified_name))))))))))
